# HeatingSetPoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..HeatingSetPoint Property
Zone Class See Also
---
Get or set the Heating Set Point of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double HeatingSetPoint { get; set; }
```

Visual Basic
---
```text
Public Property HeatingSetPoint As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HeatingSetPoint {
	double get ();
	void set (double value);
}
```

# Remarks
This property is used to get or set the Heating Set Point of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace